# -*- mode: ruby -*-

brew "ansible"
brew "bat"
brew "bitwarden-cli"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "direnv"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "go"
brew "htop"
brew "hyperfine"
brew "jq"
brew "k9s"
brew "kompose"
brew "libressl"
brew "make"
brew "micro"
brew "neofetch"
brew "netcat"
brew "node"
brew "oxipng"
brew "poppler"
brew "prettier"
brew "protobuf"
brew "pstree"
brew "python@3.14"
brew "ripgrep"
brew "rlwrap"
brew "shellcheck"
brew "sqlite"
brew "sshpass"
brew "telnet"
brew "terraform"
brew "tldr"
brew "uv"
brew "watch"
brew "zsh"

cask "aldente"
cask "chatgpt"
cask "claude-code"
cask "codex"
cask "font-geist"
cask "font-geist-mono"
cask "font-jetbrains-mono"
cask "ghostty"
cask "google-chrome"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "slack"
cask "tailscale-app"
cask "visual-studio-code"
