# -*- mode: ruby -*-

tap "nikitabobko/tap"

brew "chezmoi"
brew "bat"
brew "coreutils"
brew "direnv"
brew "fzf"
brew "gh"
brew "htop"
brew "k9s"
brew "micro"
brew "ripgrep"
brew "shellcheck"
brew "sqlite"
brew "go"
brew "python@3.14"
brew "uv"

cask "nikitabobko/tap/aerospace"
cask "codex"
cask "ghostty"
cask "obsidian"
cask "orbstack"
cask "slack"
cask "tailscale-app"
cask "visual-studio-code"
cask "font-jetbrains-mono"
cask "raycast"
